Project/controllers/AccountController.php

SELECT * FROM `user` WHERE `id`=1
---
    public function actionIndex() {
        $model = User::find()->where(['id' => Yii::$app->user->id])->one();

SELECT * FROM `user` WHERE `id`=1
---
    public function actionEdit(){

        $model = User::findOne(Yii::$app->user->id);