Project/modules/admin/views/mark/index.php


    <?php // echo $this->render('_search', ['model' => $searchModel]); ?>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            ['attribute' => 'id', 'label' => 'id'],
            ['attribute' => 'subject_id', 'value' => 'subject.title', 'label' => 'Предмет'],
            ['attribute' => 'user_id', 'label' => 'Ученик', 'value' => function ($model) {
                $name = User::find()->where(['id' => $model->id])->one();
                return $name->username;
            }],
            ['attribute' => 'mark', 'label' => 'Оценка'],

            ['class' => 'yii\grid\ActionColumn'],
        ],
    ]); ?>
---
SELECT * FROM `mark` LIMIT 20
SELECT * FROM `subject` WHERE `id`=1
SELECT COUNT(*) FROM `mark`
SELECT * FROM `user` WHERE `id`=1